Documents/СведенияОНезачисленныхВзносахОтчислениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СведенияОНезачисленныхВзносахОтчислениях</Name>
			<Comment>Сведения о незачисленных/ошибочно перечисленных взносах, отчислениях, платежах</Comment>
			<BasedOn>
				<xr:Item>Document.ВедомостьНаПеречислениеВзносовОтчислений</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаПеречислениеВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНалоговогоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияВНалоговомОргане</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СведенияОНезачисленныхВзносахОтчислениях/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Сотрудники.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомость, "Проведен, Организация");
	
	Если НЕ Ведомость.Проведен Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 не проведен.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	Если ДанныеВедомости.Организация <> Организация Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 относится к другой организации.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	

	//Если в документе выбран сотрудник, которого нет в указанной ведомости, необходимо выдавать предупреждение
	РезультатПроверки = ПроверитьСоответствиеСотрудниковВедомости();
	Если Не РезультатПроверки Тогда
		
		ТекстЕП = "";
		
		Если Ведомость.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
			ТекстЕП = "(либо не соответствуют периоды возврата между ведомостью и сведениях о незачисленных взносах, отчислениях, платежах)";
		КонецЕсли;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В таблице есть сотрудники, отсутствующие %1 в документе %2.'"), ТекстЕП, Ведомость);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	СведенияОНезачисленныхВзносахОтчисленияхПоВедомости = НезачисленияПоВедомости();
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Физлица = Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если Не Отказ И Физлица.Количество() > 0 Тогда
		
		ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, СведенияОНезачисленныхВзносахОтчисленияхПоВедомости);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
		
	Если НЕ Ведомость.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		
		НепроверяемыеРеквизиты.Добавить("Сотрудники.МесяцНалоговогоПериода");
		НепроверяемыеРеквизиты.Добавить("Сотрудники.НалогВзнос");
		НепроверяемыеРеквизиты.Добавить("Сотрудники.РегистрацияВНалоговомОргане");
		
	КонецЕсли;

	ПроверитьПересечениеСотрудников(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры

Функция НезачисленияПоВедомости() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидНалогаВзносаОтчисления,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидПлатежа
	|ПОМЕСТИТЬ ВТ_Ведомость
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
	|ГДЕ
	|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка = &Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ведомость КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо ЕСТЬ NULL
	|			ТОГДА ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо
	|		ИНАЧЕ СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НЕ ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцНалоговогоПериода ЕСТЬ NULL
	|			ТОГДА ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцНалоговогоПериода
	|		ИНАЧЕ СведенияОНезачисленныхВзносахОтчисленияхСотрудники.МесяцНалоговогоПериода
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	ВЫБОР
	|		КОГДА НЕ ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.НалогВзнос ЕСТЬ NULL
	|			ТОГДА ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.НалогВзнос
	|		ИНАЧЕ СведенияОНезачисленныхВзносахОтчисленияхСотрудники.НалогВзнос
	|	КОНЕЦ КАК НалогВзнос,
	|	ВЫБОР
	|		КОГДА НЕ ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.РегистрацияВНалоговомОргане ЕСТЬ NULL
	|			ТОГДА ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.РегистрацияВНалоговомОргане
	|		ИНАЧЕ СведенияОНезачисленныхВзносахОтчисленияхСотрудники.РегистрацияВНалоговомОргане
	|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА НЕ ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВидДохода ЕСТЬ NULL
	|			ТОГДА ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВидДохода
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ВТ_Ведомость.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
    |					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
    |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
    |			КОНЕЦ
	|	КОНЕЦ КАК ВидДохода,
	|	ВТ_Ведомость.ВидНалогаВзносаОтчисления,
	|	ВТ_Ведомость.ВидПлатежа
	|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
	|ИЗ
	|	ВТ_Ведомость КАК ВТ_Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления
	|		ПО ВТ_Ведомость.Ссылка = ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка
	|			И НЕ ВТ_Ведомость.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
	|		ПО ВТ_Ведомость.Ссылка = &Ведомость
	|			И СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка = &Ссылка
	|			И ВТ_Ведомость.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка КАК Ссылка,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_СотрудникиПоВедомости
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
	|ГДЕ
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СотрудникиПоВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
	|	ВТ_НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
	|	ВТ_НалогиВзносыОтчисления.ВидДохода,
	|	ВТ_НалогиВзносыОтчисления.ВидПлатежа
	|ИЗ
	|	ВТ_СотрудникиПоВедомости КАК ВТ_СотрудникиПоВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыОтчисления КАК ВТ_НалогиВзносыОтчисления
	|		ПО ВТ_СотрудникиПоВедомости.ФизическоеЛицо = ВТ_НалогиВзносыОтчисления.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СотрудникиПоВедомости.ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода,
	|	ВТ_НалогиВзносыОтчисления.РегистрацияВНалоговомОргане,
	|	ВТ_НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
	|	ВТ_НалогиВзносыОтчисления.ВидДохода,
	|	ВТ_НалогиВзносыОтчисления.ВидПлатежа";

	НезачисленияПоВедомости = Запрос.Выполнить().Выгрузить();
	
	Возврат НезачисленияПоВедомости;
	
КонецФункции

// Процедура регистрирует факт неудачи при попытке выплаты зарплаты документом.
// При этом ранее удержанные при выплате налоги "сторнируются".
//
// Параметры:
//		Движения 		- КоллекцияДвижений, коллекция наборов записей движений ведомости.
//		Отказ			- признак отказа выполнения операции.
//		Документ		- ссылка на документ, которым ранее была зарегистрирована выплата зарплаты.
//		ФизическиеЛица	- массив ссылок на физические лица.
//
// Обработка ошибочных ситуаций
//	выдается сообщение, признак «Отказ» выставляется в Истина.
//
Процедура ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, СведенияОНезачисленныхВзносахОтчисленияхПоВедомости) Экспорт
	
    ДатаКорректировкиВеденияУчетаПоДаннымНВО = НачалоМесяца(Константы.ДатаКорректировкиВеденияУчетаПоДаннымНВО.Получить());
    
    Для Каждого СтрокаСотрудники ИЗ СведенияОНезачисленныхВзносахОтчисленияхПоВедомости Цикл
		
	    НоваяЗапись = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаСотрудники);

		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяЗапись.НалогВзнос 	= - СтрокаСотрудники.НалогВзнос;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Период 		= Дата;
        Если НЕ ЗначениеЗаполнено(ДатаКорректировкиВеденияУчетаПоДаннымНВО)
            ИЛИ ДатаКорректировкиВеденияУчетаПоДаннымНВО <= СтрокаСотрудники.МесяцНалоговогоПериода Тогда
            НоваяЗапись.ВидДохода = СтрокаСотрудники.ВидДохода; 
        Иначе
            НоваяЗапись.ВидДохода = Справочники.ВидыДоходов.ПустаяСсылка();
        КонецЕсли;
		
	КонецЦикла;
	
	Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Истина;
	
КонецПроцедуры

Функция ПроверитьСоответствиеСотрудниковВедомости()
	
	//Получаем список сотрудников в первоначальном документе
	СотрудникиПоВедомости = Новый Массив();
	Для Каждого ДанныеСтроки Из Ведомость.НалогиВзносыОтчисления Цикл
		СотрудникиПоВедомости.Добавить(ДанныеСтроки.ФизическоеЛицо);
	КонецЦикла;
	
	//Проверяем наличие каждого сотрудника из текущего документа в ведомости
	ВсеСотрудникиСоответствуют = Истина;
	Для Каждого Сотрудник Из ЭтотОбъект.Сотрудники Цикл
		Если СотрудникиПоВедомости.Найти(Сотрудник.ФизическоеЛицо) = Неопределено Тогда
			ВсеСотрудникиСоответствуют = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ВсеСотрудникиСоответствуют
		И Ведомость.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
			|ИЗ
			|	Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
			|			ПО ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка = ВедомостьНаПеречислениеВзносовОтчислений.Ссылка
			|		ПО СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка.Ведомость = ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка
			|			И СведенияОНезачисленныхВзносахОтчисленияхСотрудники.МесяцНалоговогоПериода = ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцНалоговогоПериода
			|ГДЕ
			|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка = &ДокументСсылка
			|	И ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВсеСотрудникиСоответствуют = Ложь;
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат ВсеСотрудникиСоответствуют;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// только по одной ведомости
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаПеречислениеВзносовОтчислений") Тогда
		
		РеквизитыВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проведен, Организация, ВидНалогаВзносаОтчисления, Подразделение");
		
		Если ЗначениеЗаполнено(РеквизитыВедомости.Проведен)
			И НЕ РеквизитыВедомости.Проведен Тогда
			
			Текст = НСтр("ru='Документ %1 не проведен. Ввод на основании непроведенного документа запрещен.'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ДанныеЗаполнения);
			
			ВызватьИсключение Текст;
			
		КонецЕсли;
		
		Организация = РеквизитыВедомости.Организация;
		Ведомость = ДанныеЗаполнения;
		Если РеквизитыВедомости.Подразделение.ОбособленноеПодразделение = Истина Тогда
			Подразделение = РеквизитыВедомости.Подразделение;
		КонецЕсли;
		
		ЗаполнитьПоВедомостямКОплате(ДанныеЗаполнения, РеквизитыВедомости.ВидНалогаВзносаОтчисления);
		
		Если Сотрудники.Количество() = 0 Тогда
			Текст = НСтр("ru='На основании выбранной ведомости сотрудники для возврата отсутствуют.'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоВедомостямКОплате(Ведомость, ВидНВО) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("ВидНВО", ВидНВО);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ведомость КАК Ведомость,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка КАК СведенияОНезачисленныхСсылка,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТ_СведенияОНезачисленныхНВО
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК СведенияОНезачисленныхВзносахОтчислениях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
	|		ПО (СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка = СведенияОНезачисленныхВзносахОтчислениях.Ссылка)
	|ГДЕ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ведомость = &Ведомость
	|	И СведенияОНезачисленныхВзносахОтчислениях.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВедомостьНалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА &ВидНВО = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|			ТОГДА ВедомостьНалогиВзносыОтчисления.МесяцНалоговогоПериода
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	ВЫБОР
	|		КОГДА &ВидНВО = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|			ТОГДА ВедомостьНалогиВзносыОтчисления.РегистрацияВНалоговомОргане
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
	|	СУММА(ВЫБОР
	|			КОГДА &ВидНВО = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|				ТОГДА ВедомостьНалогиВзносыОтчисления.НалогВзнос
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НалогВзнос,
	|	ЕСТЬNULL(СведенияОНезачисленныхНВО.СведенияОНезачисленныхСсылка, ЗНАЧЕНИЕ(Документ.СведенияОНезачисленныхВзносахОтчислениях.ПустаяСсылка)) КАК СведенияОНезачисленныхВзносахОтчислениях
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНалогиВзносыОтчисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОНезачисленныхНВО КАК СведенияОНезачисленныхНВО
	|		ПО ВедомостьНалогиВзносыОтчисления.Ссылка = СведенияОНезачисленныхНВО.Ведомость
	|			И ВедомостьНалогиВзносыОтчисления.ФизическоеЛицо = СведенияОНезачисленныхНВО.ФизическоеЛицо
	|			И ВедомостьНалогиВзносыОтчисления.МесяцНалоговогоПериода = СведенияОНезачисленныхНВО.МесяцНалоговогоПериода
	|			И ВедомостьНалогиВзносыОтчисления.РегистрацияВНалоговомОргане = СведенияОНезачисленныхНВО.РегистрацияВНалоговомОргане
	|ГДЕ
	|	ВедомостьНалогиВзносыОтчисления.Ссылка = &Ведомость
	|	И ВедомостьНалогиВзносыОтчисления.НалогВзнос > 0
	|	И ЕСТЬNULL(СведенияОНезачисленныхНВО.СведенияОНезачисленныхСсылка, ЗНАЧЕНИЕ(Документ.СведенияОНезачисленныхВзносахОтчислениях.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.СведенияОНезачисленныхВзносахОтчислениях.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНалогиВзносыОтчисления.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА &ВидНВО = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|			ТОГДА ВедомостьНалогиВзносыОтчисления.МесяцНалоговогоПериода
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВидНВО = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
	|			ТОГДА ВедомостьНалогиВзносыОтчисления.РегистрацияВНалоговомОргане
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(СведенияОНезачисленныхНВО.СведенияОНезачисленныхСсылка, ЗНАЧЕНИЕ(Документ.СведенияОНезачисленныхВзносахОтчислениях.ПустаяСсылка))";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	СтруктураОтбора = Новый Структура("ФизическоеЛицо");
	
	Если ВидНВО = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		СписокСвойствоКЗаполнению = "ФизическоеЛицо,МесяцНалоговогоПериода,РегистрацияВНалоговомОргане,НалогВзнос";
	Иначе
		СписокСвойствоКЗаполнению = "ФизическоеЛицо";
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Выборка, СтруктураОтбора);
		
		Если Сотрудники.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
			НоваяСтрока = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПересечениеСотрудников(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка",  	Ссылка);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Ведомость",  Ведомость);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.НомерСтроки КАК НомерСтроки,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	&Сотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ссылка КАК Ссылка,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_СведенияОНезачисленныхНВО
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК СведенияОНезачисленныхВзносахОтчислениях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
	|		ПО СведенияОНезачисленныхВзносахОтчислениях.Ссылка = СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка
	|ГДЕ
	|	НЕ СведенияОНезачисленныхВзносахОтчислениях.Ссылка = &Ссылка
	|	И СведенияОНезачисленныхВзносахОтчислениях.Ведомость = &Ведомость
	|	И СведенияОНезачисленныхВзносахОтчислениях.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.НомерСтроки КАК НомерСтроки,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОНезачисленныхНВО.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОНезачисленныхНВО КАК СведенияОНезачисленныхНВО
	|		ПО (СведенияОНезачисленныхНВО.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|ГДЕ
	|	НЕ СведенияОНезачисленныхНВО.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Сотрудник %1 в строке %2 уже включен в ведомость %3'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.ФизическоеЛицо, Выборка.НомерСтроки, Выборка.Ссылка);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
